#01. Вывести квадрат числа
print('Введите число', end = ' ')
numb = int (input())
print ('Квадрат числа равен', numb**2)